<?php

namespace App\Constant;

class AddCodeMessage
{
    public static $uniqueCodePageTitle = [
        'en' => 'Unique Code',
        'ta' => 'யூனிக் கோடு',
    ];

    public static $uniqueCodeRoiHeading = [
        'en' => "Get ready to enjoy exciting rewards and refreshing experiences! 💫",
        'ta' => "உற்சாகமான பரிசுகள் மற்றும் புத்துணர்ச்சியான அனுபவங்களை அனுபவிக்க தயாராகுங்கள்! 💫",
    ];

    public static $uniqueCodeInputLabel = [
        'en' => 'Unique Code',
        'ta' => 'யூனிக் கோடு'
    ];

    public static $uniqueCodeInputHint = [
        'en' => 'Enter the unique code behind the label 🔍 and get started! ✨',
        'ta' => "லேபிளுக்கு 🔍 பின்புறம் இருக்கும் யுனீக் கோடை என்டர் செய்து தொடங்குங்கள்! ✨",
    ];

    public static $uniqueCodeBtnText = [
        'en' => 'Submit',
        'ta' => 'சமர்ப்பிக்கவும்'
    ];

    public static $outsideTimeWindowPageTitle = [
        'en' => 'Outside Time Window',
        'ta' => 'நேர வரம்பிற்கு வெளியே',
    ];



    public static $outsideTimeWindowHeading = [
        'en' => 'Oops!',
        'ta' => 'ஓஹோ!',
    ];

    public static $outsideTimeWindowBodyRoi = [
        'en' => "The contest hours are now closed ⏰\n\n" .
            "Please come back tomorrow between 10 AM - 10 PM with your unique code for another chance to win big! 🎁💸",
        'ta' => "போட்டி நேரம் இப்போது முடிந்து விட்டது ⏰\n\n" .
            "நாளை காலை 10 மணி முதல் இரவு 10 மணிக்குள் உங்கள் யுனீக் கோடு உடன் திரும்ப வாருங்கள், மிகப் பெரிதாக வெல்லும் இன்னொரு வாய்ப்பை பெறுங்கள்! 🎁💸"
    ];


    public static $outsideTimeWindowBtnText = [
        'en' => 'Exit',
        'ta' => 'வெளியேறு',
    ];



    public static $dailyLimitOverPageTitle = [
        'en' => 'Daily Limit Over',
        'ta' => 'நாளாந்த வரம்பு முடிந்தது',
    ];


    public static $dailyLimitOverHeading = [
        'en' => 'Oops!',
        'ta' => 'ஓஹோ!',
    ];


    public static $dailyLimitOverBody = [
        'en' => "Oh no! 😱 You’ve used up all your chances for today!\n\n" .
            "But don’t sweat it you can come back up tomorrow from 10 AM to 10 PM! ⏰\n" .
            "Return with a fresh code and get closer to those epic rewards! 🎁🔥\n\n" .
            "T&C Apply*",
        'ta' => "ஒ ஓ! 😱 இன்றைக்கான உங்கள் வாய்ப்புகள் அனைத்தையும் நீங்கள் உபயோகித்து விட்டீர்கள்!\n\n" .
            "கவலையே வேண்டாம், நாளை காலை 10 மணி மற்றும் இரவு 10 மணிக்கு இடையே நீங்கள் மீண்டும் வரலாம்! ⏰\n" .
            "புதிய கோடுடன் வாருங்கள், அந்த எபிக் ரிவார்டுகளை வெல்லும் வாய்ப்புக்கு நெருக்கமாக வாருங்கள்! 🎁🔥\n\n" .
            "நிபந்தனைகள் மற்றும் ஷரத்துகளுக்கு உட்பட்டது*"
    ];


    public static $dailyLimitOverBtnText = [
        'en' => 'Exit',
        'ta' => 'வெளியேறு',
    ];

    public static $questionPageTitle = [
        'en' => 'Answer this question',
        'ta' => '',
    ];
    public static $questionBtnText = [
        'en' => 'Submit',
        'ta' => '',
    ];

    public static $wrongAnswerPageTitle = [
        'en' => 'Oops! 😬🔍',
        'ta' => '',
    ];
    public static $wrongAnswerHeading = [
        'en' => 'Oops! 😬🔍',
        'ta' => '',
    ];
    public static $wrongAnswerBody = [
        'en' => "That wasn't the right answer this time.\n\n" .
            "But no worries - Come back with a fresh unique code and take another shot at the winning. 🎉🔥\n\n" .
            "T&C Apply*",
        'ta' => '',
    ];
    public static $wrongAnswerBtnText = [
        'en' => 'Exit',
        'ta' => 'வெளியேறு',
    ];

    public static $weeklyQuotaOverPageTitle = [
        'en' => 'Weekly Quota Over',
        'ta' => '',
    ];

    public static $weeklyQuotaOverHeading = [
        'en' => 'Oops!',
        'ta' => '',
    ];

    public static $weeklyQuotaOverBody = [
        'en' => "Looks like week's quota has already been claimed by other users.\n\n" .
            "But don't worry, many more rewards are still up for grabs!💥\n\n" .
            "Come back next week for another shot at winning big! 🎁💸\n\n" .
            "T&C Apply*",
        'ta' => "இந்த வாரக் கோட்டா ஏற்கனவே மற்ற பயனர்களால் கைப்பற்றப்பட்டுவிட்டது.\n\n" .
            "ஆனா கவலைப்படாதீங்க, இன்னும் நிறைய ரிவார்ட்ஸ் உங்களை காத்திருக்கின்றன! 💥\n\n" .
            "அடுத்த வாரம் திரும்பி வந்து மறுபடியும் பெரிய வெற்றிக்காக முயற்சி செய்யங்க! 🎁💸\n\n" .
            "விதிமுறைகள் மற்றும் நிபந்தனைகள் பொருந்தும்*",
    ];

    public static $weeklyQuotaOverBtnText = [
        'en' => 'Exit',
        'ta' => 'வெளியேறு',
    ];




    public static $tncBtnText = [
        'en' => 'Terms & Conditions',
        'ta' => "விதிமுறைகள் மற்றும் நிபந்தனைகள்",
    ];

    public static $usedUniqueCode = [
        'en' => "This unique code has been used before. Grab a NEW bottle, find the fresh unique code under the label, and come back!",
        'ta' => "இந்த யூனீக் கோடு இதற்கு முன்பே உபயோகிக்கப்பட்டுவிட்டது. புதிய பாட்டிலை எடுங்கள் லேபிளுக்கு கீழே யுனீக் கோடை பார்த்து விட்டு திரும்ப வாருங்கள்!",
    ];

    public static $invalidUniqueCode = [
        'en' => 'Oh No! This isn\'t the correct code. Please try again ({{codeCount}}/5)',
        'ta' => 'ஓ இல்லை! இது சரியான கோடு அல்ல. மீண்டும் முயற்சிக்கவும் ({{codeCount}}/5)',
    ];

    public static $dailyQuotaOverPageTitle = [
        'en' => "Daily Limit Over",
        'ta' => "நாளாந்த வரம்பு முடிந்தது",
    ];

    public static $dailyQuotaOverHeading = [
        'en' => "Oops!",
        'ta' => "ஓஹோ!",
    ];

    public static $dailyQuotaOverBody = [
        'en' => "Looks like today's daily quota for the PhonePe Gift Voucher has already been claimed by other users.\n\n" .
            "But don't worry, many more rewards are still up for grabs!💥\n\n" .
            "Come back tomorrow between 10 AM – 10 PM for another shot at winning big! 🎁💸\n\n" .
            "T&C Apply* ",
        'ta' => "போன்பே கிஃப்ட் வவுச்சருக்கான தினசரி கோட்டா ஏற்கனவே மற்ற யூஸர்களால் கிளெய்ம் செய்து விட்டது போல தெரிகிறது.\n\n" .
            "கவலை வேண்டாம், எடுத்துக் கொள்ள இன்னமும் ஏராளமான ரிவார்டுகள் உள்ளன!\n\n" .
            "இன்னொரு ஷாட் விளையாடு பெரிதாக வெல்வதற்கு நாளை காலை 10 மணி மற்றும் இரவு 10 மணிக்குள் மீண்டும் வாருங்கள்! 🎁💸\n\n" .
            "நிபந்தனைகள் மற்றும் ஷரத்துகளுக்கு உட்பட்டது* "
    ];

    public static $wonTodayOverBody = [
        'en' => "Looks like you've already claimed your PhonePe ₹{{amount}} voucher for today! 🎉\n\n" .
            "But no worries — there are plenty more rewards waiting for you. 💥\n\n" .
            "Come back tomorrow between 10 AM – 10 PM with a fresh unique code for another chance to win! 🎁💸\n\n" .
            "T&C Apply*",
        'ta' => "இன்றைய நாளுக்காக நீங்கள் ஏற்கனவே ₹50-க்கான போன்பே வ்வுச்சரை கிளெய்ம் செய்து விட்டீர்கள்! 🎉\n\n" .
            "கவலை வேண்டாம். இன்னும் ஏராளமான வெகுமதிகள் உங்களுக்காக காத்திருக்கின்றன. 💥\n\n" .
            "நாளை காலை 10 மணி முதல் இரவு 10 மணிக்குள் புதி. யுனீக் கோடு உடன் திரும்ப வாருங்கள், வெல்வதற்கு இன்னொரு வாய்ப்பைப் பெறுங்கள்! 🎁💸\n\n" .
            "நிபந்தனைகள் மற்றும் ஷரத்துகளுக்கு உட்பட்டது*"
    ];

    public static $dailyQuotaBtnText = [
        'en' => "Exit",
        'ta' => "வெளியேறு",
    ];

    // Hourly quota over
    public static $hourlyQuotaOverPageTitle = [
        'en' => "Hourly Limit Over",
        'ta' => "மணிநேர வரம்பு முடிந்தது",
    ];

    public static $hourlyQuotaOverHeading = [
        'en' => "Oops!",
        'ta' => "ஓஹோ!",
    ];

    public static $hourlyQuotaOverBody = [
        'en' => "Looks like this hour's PhonePe Gift Voucher quota has already been snapped up by other users!\n\n" .
            "But don't worry — the next round of rewards drops soon! ⏳🔥\n\n" .
            "👉 Swing by at the start of the next hour for another chance to win big! 🎁💸\n\n" .
            "And hey, don't be sad — you still bagged 25 runs! 🏏✨\n" .
            "Check them out in the My Wins section.\n\n" .
            "T&C Apply*",
        'ta' => "இந்த மணி நேரத்தின் PhonePe கிஃப்ட் வவுச்சர் ஒதுக்கீட்டை மற்ற பயனர்கள் எடுத்துவிட்டதாகத் தெரிகிறது!\n\n" .
            "ஆனால் கவலைப்பட வேண்டாம் — அடுத்த சுற்று பரிசுகள் விரைவில் வருகிறது! ⏳🔥\n\n" .
            "👉 பெரிய வெற்றிக்கான மற்றொரு வாய்ப்பிற்காக அடுத்த மணி நேரத்தின் தொடக்கத்தில் வாருங்கள்! 🎁💸\n\n" .
            "கவனியுங்கள், வருத்தப்பட வேண்டாம் — நீங்கள் இன்னும் 25 ரன்கள் எடுத்துள்ளீர்கள்! 🏏✨\n" .
            "அவற்றை My Wins பிரிவில் பார்க்கவும்।\n\n" .
            "விதிமுறைகள் & நிபந்தனைகள் பொருந்தும்*",
    ];

    public static $hourlyQuotaBtnText = [
        'en' => "Exit",
        'ta' => "வெளியேறு",
    ];

    public static $wonMassRewardPageTitle = [
        'en' => "🎊✨ Congratulations! ✨🎊",
        'ta' => "🎊✨ வாழ்த்துகள்! ✨🎊",
    ];

    public static $wonMassRewardHeading = [
        'en' => "🎉 Hooray! 🥳",
        'ta' => "🎉 ஹுர்ரா! 🥳",
    ];

    public static $wonMassRewardTextBody = [
        'en' => "You've bagged a PhonePe Gift Voucher worth ₹{{amount}}! 💸\n\n" .
            "🔑 Your Coupon Code: {{couponCode}}\n\n" .
            "Pin: {{PIN}}\n\n" .
            "Click on Redeem Now to visit PhonePe and redeem your reward! 🛍️✨\n\n" .
            "Redeem by: {{redeemByDate}}\n\n" .
            "T&C Apply*",
        'ta' => "நீங்கள் ₹{{amount}} மதிப்புள்ள போன்பே கிஃப்ட் வ்வுச்சரை  வென்றிருக்கிறீர்கள்! 💸\n\n" .
            "🔑 உங்கள் கூப்பன் கோடு: {{couponCode}}\n\n" .
            "பின்: {{PIN}}\n\n" .
            "போன்பேவை பார்த்து உங்கள் ரிவார்டை ரெடீம் செய்து கொள்ள ரெடீம் நவ் என்பதின் மேல் கிளிக் செய்யுங்கள்! 🛍️✨\n\n" .
            "ரெடீம் செய்து கொள்ள வேண்டிய தேதி: {{redeemByDate}}\n\n" .
            "நிபந்தனைகள் மற்றும் ஷரத்துகளுக்கு உட்பட்டது*",
    ];

    public static $redeemNowBtnText = [
        'en' => "Redeem Now",
        'ta' => "இப்போது ரிடீம் செய்யவும்",
    ];

    public static $wonMassRewardBtnText = [
        'en' => "Submit",
        'ta' => "சமர்ப்பிக்கவும்",
    ];


    public static $wonBumperRewardPageTitle = [
        'en' => "🎊✨ Congratulations! ✨🎊",
        'ta' => "🎊✨ வாழ்த்துகள்! ✨🎊",
    ];


    public static $wonTicketHeading = [
        'en' => "🎉🏏 Woohoo! Big Congrats!",
        'ta' => "",
    ];

    public static $wonTicketTextBody = [
        'en' => "You've won ICC Men's T20 World Cup, 2026 match tickets 🎟️🔥\n" .
            "Get ready for the ultimate cricket experience! 🏏✨\n\n" .
            "To help us plan your reward, please select your top 3 preferred cities for the match.",

        'ta' => "நீங்கள் ICC மென்ஸ் T20 வேர்ல்ட் கப், 2026 மேட்ச் டிக்கெட்டுகளை வென்றுள்ளீர்கள். 🎟️🔥\n" .
            "இணையற்ற கிரிக்கெட் அனுபவத்தைப் பெறுவதற்கு தயாராகுங்கள்! 🏏✨\n\n" .
            "உங்கள் பரிசுகளை திட்டமிட எங்களுக்கு உதவுங்கள், மேட்ச்சை காண நீங்கள் விரும்பும் 3 முன்னணி நகரங்களை தேர்வு செய்யுங்கள்.",
    ];

    public static $wonTicketBtnText = [
        'en' => "Select City",
        'ta' => "நகரத்தைத் தேர்ந்தெடுக்கவும்",
    ];

    // ____________________

    public static $wonMerchHeading = [
        'en' => "🎉 Congratulations!",
        'ta' => "🎉 வாழ்த்துகள்!",
    ];

    public static $wonMerchTextBody = [
        'en' => "You've bagged the Thums Up® Merchandise. Fill the claim form for us to deliver the merchandise to your doorstep  🏏✨",
        'ta' => "நீங்கள் Thums Up® மர்சண்டைஸ் பெற்றுள்ளீர்கள். மர்சண்டைசை உங்கள் கதவிற்கு கொண்டு வர, தயவுசெய்து க்ளெயிம் படிவத்தை நிரப்பவும் 🏏✨",
    ];

    public static $wonMerchBtnText = [
        'en' => "Claim Now",
        'ta' => "இப்போது க்ளெய்ம் செய்யவும்",
    ];
}
